In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\andres\appdata\local\programs\python\python38-32\lib\site-packages (1.1.4)

WARNING: You are using pip version 19.2.3, however version 21.0.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

Requirement already satisfied: numpy>=1.15.4 in c:\users\andres\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (1.19.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\andres\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\andres\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (2020.4)
Requirement already satisfied: six>=1.5 in c:\users\andres\appdata\roaming\python\python38\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [4]:
import pandas as pd
import numpy as np

In [5]:
# The series ###
#The series is the object of the pandas library designed to represent one-dimensional data structures.
# We should to declare the series. 
s = pd.Series([12,5,7,9,-4])
s

0    12
1     5
2     7
3     9
4    -4
dtype: int64

In [7]:
# The index should be inside he function
# to separate arguemnts we must use commas.
p = pd.Series([16,18,17,19,20], index = ["GDP","EEP","ÉTICA","LAB DE TERMO","TESIS 2"])
print(p)

GDP             16
EEP             18
ÉTICA           17
LAB DE TERMO    19
TESIS 2         20
dtype: int64

In [8]:
## to know the structure of series, we must code s.value, s.index
p.values

array([16, 18, 17, 19, 20], dtype=int64)

In [20]:
p.index # in series is index whereas in dataframe we use columns

Index(['GDP', 'EEP', 'ÉTICA', 'LAB DE TERMO', 'TESIS 2'], dtype='object')

In [21]:
## Selecting the Internal Elements
p['GDP']
#observations: if we want to know select the value, we should code p[index as array]
# but if we want to do the same operation selecting the index, we must code p['index'], between in quotes

16

In [25]:
# for to o more indexes we must code s[0:2] for example, or s[['b','c']] 
p[['GDP', 'EEP','TESIS 2']]

GDP        16
EEP        18
TESIS 2    20
dtype: int64

In [26]:
p[0:2]

GDP    16
EEP    18
dtype: int64

In [22]:
## Assingning the values to the elements 
# to assing values to the item we must code s[0] = new value for example

p[2] = 3567
p

a       2.34
b       4.35
c    3567.00
dtype: float64

In [11]:
## Defining a Series from NumPy Arrays and Other series
numpy_array = np.array([100,200,300,400])
series_python = [5,10,15,20] # Normal python serie

serie_pandas = pd.Series(numpy_array, index = ['Luis','Felipe','Ricardo','Omar'])
serie_pandas

# we only must declare the array what we want to assing to new serie in pandas library

Luis       100
Felipe     200
Ricardo    300
Omar       400
dtype: int32

In [29]:
## Filtering values
# We can aggregate conditional 
# for example if I want to filter the numbers of the list that are greater than 14
# i must write the floowing code:
p[p > 14]
# i must repeat the name of the series inside the brackets

c    3567.0
dtype: float64

In [34]:
## Operations and mathematical functions
# The operations functions as R vector:
#for example:
p[1] = p[1]*100
p[2] = p[2]/1000
p[0] = p[0]*100

a      234.0
b    43500.0
c      356.7
dtype: float64

In [35]:
np.log(p)

a     5.455321
b    10.680516
c     5.876895
dtype: float64

In [19]:
# Evaluating values
# unique() ----- the function allows to obtain unique values--- return array object
#value_counts() --- this function gives us the frecuency that one value is contained inside the serie.

#We are going to define one serie of courses to get the bachellor:
courses = pd.Series(['Simulación','EEP','GDP','Ética','Tesis2','Lab de Termo','PSP2','Inglés'])
courses
courses.value_counts() #or pd.value_counts(courses)

Lab de Termo    1
GDP             1
EEP             1
PSP2            1
Simulación      1
Ética           1
Inglés          1
Tesis2          1
dtype: int64

In [38]:
p.unique()

array([  234. , 43500. ,   356.7])

In [40]:
p.value_counts()

# it doesn't matter what type of code we decide.

356.7      1
43500.0    1
234.0      1
dtype: int64

In [44]:
p.isin([356.7])
#Function isin() allows to answer if one value belong to the serie

a    False
b    False
c     True
dtype: bool

In [47]:
# If we want to know the indexes of the NAN Values, we must use the functions is.null() or not.null() like this
pd.notnull(p)

a    True
b    True
c    True
dtype: bool

In [48]:
p.notnull()

a    True
b    True
c    True
dtype: bool

In [54]:
# Series as dictionaries
## We create dictionaries
## Assing the dictionarie to the serie

dict = {"Espinacas":300, "Tomate":400, "Cebolla": 500}
serie_pandas = pd.Series(dict)
serie_pandas

Espinacas    300
Tomate       400
Cebolla      500
dtype: int64

In [20]:
# DATA FRAMES

data = {'Color' : ['blue','green','yellow','red','white'],
        'Object': ['ball','pen','pencil','paper','mug'],
        'Price': [1.2,1,0.6,0.9,1.7]}
frame = pd.DataFrame(data)
frame

    Color  Object  Price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [58]:
# Another way to built one dataframe

frame3 = pd.DataFrame(np.arange(16).reshape((4,4)), 
                      index = ['red','blue','yellow','white'],
                      columns = ['ball','pen','pencil','paper'])
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [23]:
### Exercise: dfine two dataframes

diccionario = {"Nombres":['Oliver','Lilu','Omar','Rosa','Kimy'],
              "Apellidos":['Revilla','Tiburcio','Huaman','Abanto','Chávez'],
              "DNI":[70211201,76564535,76584321,72345675,71234564],
              "Edad":[23,24,23,27,22]}
frame1 = pd.DataFrame(diccionario)
frame1

  Nombres Apellidos       DNI  Edad
0  Oliver   Revilla  70211201    23
1    Lilu  Tiburcio  76564535    24
2    Omar    Huaman  76584321    23
3    Rosa    Abanto  72345675    27
4    Kimy    Chávez  71234564    22

In [24]:
#Selecting elements
frame1.columns

Index(['Nombres', 'Apellidos', 'DNI', 'Edad'], dtype='object')

In [25]:
frame1.values # give us the values of the dataframe.

array([['Oliver', 'Revilla', 70211201, 23],
       ['Lilu', 'Tiburcio', 76564535, 24],
       ['Omar', 'Huaman', 76584321, 23],
       ['Rosa', 'Abanto', 72345675, 27],
       ['Kimy', 'Chávez', 71234564, 22]], dtype=object)

In [26]:
frame1.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
frame1['Nombres']

0    Oliver
1      Lilu
2      Omar
3      Rosa
4      Kimy
Name: Nombres, dtype: object

In [68]:
frame1['Apellidos']

0     Revilla
1    Tiburcio
2      Huaman
3      Abanto
4      Chávez
Name: Apellidos, dtype: object

In [74]:
frame1['Edad']

0    23
1    24
2    23
3    27
4    22
Name: Edad, dtype: int64

In [12]:
frame1.Apellidos

0     Revilla
1    Tiburcio
2      Huaman
3      Abanto
4      Chávez
Name: Apellidos, dtype: object

In [13]:
frame1[0:1]

  Nombres Apellidos       DNI  Edad
0  Oliver   Revilla  70211201    23

In [28]:
frame1[:3]

  Nombres Apellidos       DNI  Edad
0  Oliver   Revilla  70211201    23
1    Lilu  Tiburcio  76564535    24
2    Omar    Huaman  76584321    23

In [29]:
#Assigning values
frame1.index.name = 'id'    # Using that method we can assign the names
frame1.columns.name = 'item'
frame1

item Nombres Apellidos       DNI  Edad
id
0     Oliver   Revilla  70211201    23
1       Lilu  Tiburcio  76564535    24
2       Omar    Huaman  76584321    23
3       Rosa    Abanto  72345675    27
4       Kimy    Chávez  71234564    22

In [30]:
# Creating a new column
frame1['auto'] = ['Lamborgini','Mercedes','Toyota','Aston Martin','Ferrari']
frame1

item Nombres Apellidos       DNI  Edad          auto
id
0     Oliver   Revilla  70211201    23    Lamborgini
1       Lilu  Tiburcio  76564535    24      Mercedes
2       Omar    Huaman  76584321    23        Toyota
3       Rosa    Abanto  72345675    27  Aston Martin
4       Kimy    Chávez  71234564    22       Ferrari

In [36]:
# Membership of value
#isin() function helps us to find value within dataframe.

frame1.isin(['Oliver','Revilla'])

item  Nombres  Apellidos    DNI   Edad    new
id
0        True       True  False  False  False
1       False      False  False  False  False
2       False      False  False  False  False
3       False      False  False  False  False
4       False      False  False  False  False

In [47]:

frame1[frame1.isin(['Oliver','Revilla'])]

item Nombres Apellidos  DNI  Edad
id
0     Oliver   Revilla  NaN   NaN
1        NaN       NaN  NaN   NaN
2        NaN       NaN  NaN   NaN
3        NaN       NaN  NaN   NaN
4        NaN       NaN  NaN   NaN

In [49]:
frame1['new'] = frame1.Edad/2
frame1

item Nombres Apellidos       DNI  Edad   new
id
0     Oliver   Revilla  70211201    23  11.5
1       Lilu  Tiburcio  76564535    24  12.0
2       Omar    Huaman  76584321    23  11.5
3       Rosa    Abanto  72345675    27  13.5
4       Kimy    Chávez  71234564    22  11.0

In [50]:
# Deleting a column
del frame1['new']
frame1

item Nombres Apellidos       DNI  Edad
id
0     Oliver   Revilla  70211201    23
1       Lilu  Tiburcio  76564535    24
2       Omar    Huaman  76584321    23
3       Rosa    Abanto  72345675    27
4       Kimy    Chávez  71234564    22

In [54]:
#Filtering
frame1[frame1.Edad > 23] #Select with conditionals

item Nombres Apellidos       DNI  Edad
id
1       Lilu  Tiburcio  76564535    24
3       Rosa    Abanto  72345675    27

In [73]:
frame1[frame1.Nombres =='Lilu']

item Nombres Apellidos       DNI  Edad
id
1       Lilu  Tiburcio  76564535    24

In [75]:
## DataFrame from Nested dict
nestdict = {'red':{2012:22,2013:33},
            'white':{2011:13,2012:22,2013:16},
            'blue':{2011:17,2012:27,2013:18},    
}
pd.DataFrame(nestdict)

       red  white  blue
2012  22.0     22    27
2013  33.0     16    18
2011   NaN     13    17

In [31]:
## Transposition of a DataFrame
#Only we should add T attribute to the frame.
frame1.T

id                  0         1         2             3         4
item
Nombres        Oliver      Lilu      Omar          Rosa      Kimy
Apellidos     Revilla  Tiburcio    Huaman        Abanto    Chávez
DNI          70211201  76564535  76584321      72345675  71234564
Edad               23        24        23            27        22
auto       Lamborgini  Mercedes    Toyota  Aston Martin   Ferrari

# Other functionalities on Indexes

In [32]:
#Reindexing
frame1

item Nombres Apellidos       DNI  Edad          auto
id
0     Oliver   Revilla  70211201    23    Lamborgini
1       Lilu  Tiburcio  76564535    24      Mercedes
2       Omar    Huaman  76584321    23        Toyota
3       Rosa    Abanto  72345675    27  Aston Martin
4       Kimy    Chávez  71234564    22       Ferrari

In [33]:
frame1.reindex([4,3,2,1,0])

item Nombres Apellidos       DNI  Edad          auto
id
4       Kimy    Chávez  71234564    22       Ferrari
3       Rosa    Abanto  72345675    27  Aston Martin
2       Omar    Huaman  76584321    23        Toyota
1       Lilu  Tiburcio  76564535    24      Mercedes
0     Oliver   Revilla  70211201    23    Lamborgini

In [34]:
#Dropping
frame1.drop([4,3]) # We can drop one row throught its index

item Nombres Apellidos       DNI  Edad        auto
id
0     Oliver   Revilla  70211201    23  Lamborgini
1       Lilu  Tiburcio  76564535    24    Mercedes
2       Omar    Huaman  76584321    23      Toyota

In [94]:
#Operations between data structures.
#add(): frame1 + frame 2 -> frame1.add(frame2)
#sub()
#div()
#mul()

# Functions application and mapping

In [35]:
#Functions by element
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index = ['red','blue','yellow','white'],
                     columns = ['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [36]:
np.sqrt(frame) # this fuction calculates the square root of one frame.

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [37]:
#Functions by row or column
def f(x):
    return x.max() - x.min()

#we use the apply method to apply this function to all vlues of the frame.
frame.apply(f)
# The reuslt was calculated column by column. If we want to have the result by rows, we have to change the axis from 0 to 1
# axis = 1

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [38]:
frame.apply(f, axis = 1)

red       3
blue      3
yellow    3
white     3
dtype: int64

In [39]:
# we can extend the use of apply method through the use of series, look at the next:
def lamda(x):
    return pd.Series([x.min(),x.max()],index = ['min','max'])

frame.apply(lamda)

     ball  pen  pencil  paper
min     0    1       2      3
max    12   13      14     15

In [40]:
frame.apply(lamda, axis = 1)

        min  max
red       0    3
blue      4    7
yellow    8   11
white    12   15

In [41]:
#Statistics functions
# 1.- sum() : total sum
# 2.- mean() : average
# 3.- describe(): give us the summary statistics
frame.sum()

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [43]:
frame.mean()

ball      6.0
pen       7.0
pencil    8.0
paper     9.0
dtype: float64

In [44]:
frame.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [45]:
# Sorting and ranking
# 1.- sort_index()
# 2.- sort_values()
# 3.- rank()
ser = pd.Series([5,0,3,8,4],
                index = ['red','blue','yellow','white','green'])
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [46]:
ser.sort_index() #default behavior

blue      0
green     4
red       5
white     8
yellow    3
dtype: int64

In [48]:
ser.sort_index(ascending = False)

yellow    3
white     8
red       5
green     4
blue      0
dtype: int64

In [50]:
frame.sort_index(axis = 1)

        ball  paper  pen  pencil
red        0      3    1       2
blue       4      7    5       6
yellow     8     11    9      10
white     12     15   13      14

In [52]:
# to order the values we use the sort_values() function.
frame.sort_values(by = 'pencil')

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [53]:
frame.sort_values(by= ['ball','pen'])

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [57]:
ser.rank() #give us the index

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

# Correlation and covariance

In [28]:
#1.- corr()
#2.- cov()
seq2 = pd.Series([3,4,3,4,5,4,3,2],['2006','2007','2008','2009','2010','2011','2012','2013'])
seq1 = pd.Series([1,2,3,4,4,3,2,1],['2006','2007','2008','2009','2010','2011','2012','2013'])
seq1.cov(seq2)
seq1.corr(seq2)

0.7745966692414835

# NOT A NUMBER DATA

In [66]:
#Assingning a NaN Value
#1.- np.NaN
ser = pd.Series([0,1,2,np.NaN,9],
               index = ['red','blue','yellow','white','green'])
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [67]:
ser['white']

nan

In [68]:
#Filtering Out NaN Values
#1.- dropna()
ser.dropna()

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [69]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [78]:
# to work with dataframes, we use the dropna() function but we should specify what column we want to evaluate.
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,2,np.nan],[2,3,5]],
                     index = ['blue','green','red'],
                     columns = ['ball','mug','pen'])
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  2.0  NaN
red     2.0  3.0  5.0

In [79]:
frame3.dropna()

     ball  mug  pen
red   2.0  3.0  5.0

In [80]:
frame3.dropna(how = 'all')

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  2.0  NaN
red     2.0  3.0  5.0

In [81]:
#Filling in NaN Occurences
#1.- fillna()
frame3.fillna(0)

       ball  mug  pen
blue    6.0  0.0  6.0
green   0.0  2.0  0.0
red     2.0  3.0  5.0

In [82]:
frame3.fillna({'ball':1,'mug':0,'pen':99})

       ball  mug   pen
blue    6.0  0.0   6.0
green   1.0  2.0  99.0
red     2.0  3.0   5.0

# Hierarchical Indexing and Leveling

In [83]:
# fucntions:
#1.- unstack() : converts a hierarchical index to a simple dataframe
#2.- stack():converts a dataframe  to a hierarchical index.
mser = pd.Series(np.random.rand(8),
                index = [['white','white','white','blue','blue','red','red','red'],
                        ['up','down','right','up','down','up','down','left']])
mser

white  up       0.785902
       down     0.542222
       right    0.693393
blue   up       0.638327
       down     0.666236
red    up       0.307199
       down     0.776126
       left     0.728193
dtype: float64

In [86]:
mser.index

MultiIndex([('white',    'up'),
            ('white',  'down'),
            ('white', 'right'),
            ( 'blue',    'up'),
            ( 'blue',  'down'),
            (  'red',    'up'),
            (  'red',  'down'),
            (  'red',  'left')],
           )

In [87]:
mser['white']

up       0.785902
down     0.542222
right    0.693393
dtype: float64

In [92]:
mser[:,'up']

white    0.785902
blue     0.638327
red      0.307199
dtype: float64

In [93]:
# If we need to select one specific value, we specify both indexes.
mser['white','up']

0.7859016423364491

In [94]:
mser.unstack()

           down      left     right        up
blue   0.666236       NaN       NaN  0.638327
red    0.776126  0.728193       NaN  0.307199
white  0.542222       NaN  0.693393  0.785902

In [95]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [96]:
frame.stack()

red     ball       0
        pen        1
        pencil     2
        paper      3
blue    ball       4
        pen        5
        pencil     6
        paper      7
yellow  ball       8
        pen        9
        pencil    10
        paper     11
white   ball      12
        pen       13
        pencil    14
        paper     15
dtype: int32

In [98]:
#Reordering and sorting levels
#swap.level()
#sort_index(level ='')
mframe = pd.DataFrame(np.random.rand(16).reshape(4,4),
                     index = [['white','white','red','red'],
                             ['up','down','up','down']],
                     columns = [['pen','pen','paper','paper'],[1,2,1,2]])
mframe

                 pen               paper
                   1         2         1         2
white up    0.203306  0.585180  0.439483  0.929638
      down  0.642507  0.215771  0.346265  0.450234
red   up    0.559827  0.743414  0.153499  0.606347
      down  0.333679  0.090403  0.604182  0.695602

In [99]:
mframe.columns.names = ['objects','id']
mframe.index.names = ['colors','status']
mframe

objects             pen               paper
id                    1         2         1         2
colors status
white  up      0.203306  0.585180  0.439483  0.929638
       down    0.642507  0.215771  0.346265  0.450234
red    up      0.559827  0.743414  0.153499  0.606347
       down    0.333679  0.090403  0.604182  0.695602

In [100]:
mframe.swaplevel('colors','status')

objects             pen               paper
id                    1         2         1         2
status colors
up     white   0.203306  0.585180  0.439483  0.929638
down   white   0.642507  0.215771  0.346265  0.450234
up     red     0.559827  0.743414  0.153499  0.606347
down   red     0.333679  0.090403  0.604182  0.695602

In [105]:
mframe.sort_index(level = 'colors')

objects             pen               paper
id                    1         2         1         2
colors status
red    down    0.333679  0.090403  0.604182  0.695602
       up      0.559827  0.743414  0.153499  0.606347
white  down    0.642507  0.215771  0.346265  0.450234
       up      0.203306  0.585180  0.439483  0.929638